000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаДанныеПотокаОбмена/КафкаДанныеПотокаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КафкаДанныеПотокаОбмена</name>
  <resources>
    <name>ПолученныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПолучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветСервера</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаДанныеПотокаОбмена/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПотокаОбмена.ПолученныеДанные
		|ИЗ
		|	РегистрСведений.КафкаДанныеПотокаОбмена КАК ДанныеПотокаОбмена
		|ГДЕ
		|	ДанныеПотокаОбмена.ВремяПолучения = &ВремяПолучения";
	
	Запрос.УстановитьПараметр("ВремяПолучения", Запись.ВремяПолучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПолученныеДанныеОбмена = Выборка.ПолученныеДанные.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
